In [2]:
import pandas as pd

In [5]:
data = {"name":["Arun", "Bharath", "Chinna", "Deepak","Rijesh", "Giribalan", "Sailajan", "Navakriyan", "Daran", "Rajkiran"],
        "Age": [20, 21, 22, 18, 20, 25, 18, 19, 17, 20]}

In [15]:
df = pd.DataFrame(data)

In [19]:
df.head()

      name  Age
0     Arun   20
1  Bharath   21
2   Chinna   22
3   Deepak   18
4   Rijesh   20

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   Age     10 non-null     int64
dtypes: int64(1), object(1)
memory usage: 292.0+ bytes